wkk0912/pic18f6621modify/pic18fxx22.h
/* Definitions for INTCON register */
static volatile near bit	RBIF		@ ((unsigned)&INTCON*8)+0;
static volatile near bit	INT0IF		@ ((unsigned)&INTCON*8)+1;
static volatile near bit	TMR0IF		@ ((unsigned)&INTCON*8)+2;
static          near bit	RBIE		@ ((unsigned)&INTCON*8)+3;
static          near bit	INT0IE		@ ((unsigned)&INTCON*8)+4;
static          near bit	TMR0IE		@ ((unsigned)&INTCON*8)+5;
static          near bit	PEIE		@ ((unsigned)&INTCON*8)+6;
static          near bit	GIE		@ ((unsigned)&INTCON*8)+7;
/* Alternate definitions for INTCON register */
static          near bit	GIEL		@ ((unsigned)&INTCON*8)+6;
static          near bit	GIEH		@ ((unsigned)&INTCON*8)+7;

/* Definitions for INTCON2 register */
static          near bit	RBIP		@ ((unsigned)&INTCON2*8)+0;
static          near bit	INT3IP		@ ((unsigned)&INTCON2*8)+1;
static          near bit	TMR0IP		@ ((unsigned)&INTCON2*8)+2;
static          near bit	INTEDG3		@ ((unsigned)&INTCON2*8)+3;
static          near bit	INTEDG2		@ ((unsigned)&INTCON2*8)+4;
static          near bit	INTEDG1		@ ((unsigned)&INTCON2*8)+5;
static          near bit	INTEDG0		@ ((unsigned)&INTCON2*8)+6;
static          near bit	RBPU		@ ((unsigned)&INTCON2*8)+7;

/* Definitions for INTCON3 register */
static volatile near bit	INT1IF		@ ((unsigned)&INTCON3*8)+0;
static volatile near bit	INT2IF		@ ((unsigned)&INTCON3*8)+1;
static volatile near bit	INT3IF		@ ((unsigned)&INTCON3*8)+2;
static          near bit	INT1IE		@ ((unsigned)&INTCON3*8)+3;
static          near bit	INT2IE		@ ((unsigned)&INTCON3*8)+4;
static          near bit	INT3IE		@ ((unsigned)&INTCON3*8)+5;
static          near bit	INT1IP		@ ((unsigned)&INTCON3*8)+6;
static          near bit	INT2IP		@ ((unsigned)&INTCON3*8)+7;

/* Definitions for STATUS register */
static volatile near bit	CARRY		@ ((unsigned)&STATUS*8)+0;
static volatile near bit	DC		@ ((unsigned)&STATUS*8)+1;
static volatile near bit	ZERO		@ ((unsigned)&STATUS*8)+2;
static volatile near bit	OV		@ ((unsigned)&STATUS*8)+3;
static volatile near bit	NEGATIVE	@ ((unsigned)&STATUS*8)+4;

/* Definitions for T0CON register */
static          near bit	T0PS0		@ ((unsigned)&T0CON*8)+0;
static          near bit	T0PS1		@ ((unsigned)&T0CON*8)+1;
static          near bit	T0PS2		@ ((unsigned)&T0CON*8)+2;
static          near bit	PSA		@ ((unsigned)&T0CON*8)+3;
static          near bit	T0SE		@ ((unsigned)&T0CON*8)+4;
static          near bit	T0CS		@ ((unsigned)&T0CON*8)+5;
static          near bit	T08BIT		@ ((unsigned)&T0CON*8)+6;
static          near bit	TMR0ON		@ ((unsigned)&T0CON*8)+7;

/* Definitions for OSCCON register */
static          near bit	SCS0		@ ((unsigned)&OSCCON*8)+0;
static          near bit	SCS1		@ ((unsigned)&OSCCON*8)+1;
static volatile near bit	IOFS		@ ((unsigned)&OSCCON*8)+2;
static volatile near bit	OSTS		@ ((unsigned)&OSCCON*8)+3;
static          near bit	IRCF0		@ ((unsigned)&OSCCON*8)+4;
static          near bit	IRCF1		@ ((unsigned)&OSCCON*8)+5;
static          near bit	IRCF2		@ ((unsigned)&OSCCON*8)+6;
static          near bit	IDLEN		@ ((unsigned)&OSCCON*8)+7;

/* Definitions for HLVDCON register */
static          near bit	HLVDL0		@ ((unsigned)&HLVDCON*8)+0;
static          near bit	HLVDL1		@ ((unsigned)&HLVDCON*8)+1;
static          near bit	HLVDL2		@ ((unsigned)&HLVDCON*8)+2;
static          near bit	HLVDL3		@ ((unsigned)&HLVDCON*8)+3;
static          near bit	HLVDEN		@ ((unsigned)&HLVDCON*8)+4;
static volatile near bit	IRVST		@ ((unsigned)&HLVDCON*8)+5;
static          near bit	VDIRMAG		@ ((unsigned)&HLVDCON*8)+7;

/* Definitions for WDTCON register */
static          near bit	SWDTEN		@ ((unsigned)&WDTCON*8)+0;

/* Definitions for RCON register */
static volatile near bit	BOR		@ ((unsigned)&RCON*8)+0;
static volatile near bit	POR		@ ((unsigned)&RCON*8)+1;
static volatile near bit	PD		@ ((unsigned)&RCON*8)+2;
static volatile near bit	TO		@ ((unsigned)&RCON*8)+3;
static volatile near bit	RI		@ ((unsigned)&RCON*8)+4;
static          near bit	SBOREN		@ ((unsigned)&RCON*8)+6;
static          near bit	IPEN		@ ((unsigned)&RCON*8)+7;

/* Definitions for T1CON register */
static          near bit	TMR1ON		@ ((unsigned)&T1CON*8)+0;
static          near bit	TMR1CS		@ ((unsigned)&T1CON*8)+1;
static          near bit	T1SYNC		@ ((unsigned)&T1CON*8)+2;
static          near bit	T1OSCEN		@ ((unsigned)&T1CON*8)+3;
static          near bit	T1CKPS0		@ ((unsigned)&T1CON*8)+4;
static          near bit	T1CKPS1		@ ((unsigned)&T1CON*8)+5;
static          near bit	T1RUN		@ ((unsigned)&T1CON*8)+6;
static          near bit	T1RD16		@ ((unsigned)&T1CON*8)+7;

/* Definitions for T2CON register */
static          near bit	T2CKPS0		@ ((unsigned)&T2CON*8)+0;
static          near bit	T2CKPS1		@ ((unsigned)&T2CON*8)+1;
static          near bit	TMR2ON		@ ((unsigned)&T2CON*8)+2;
static          near bit	T2OUTPS0	@ ((unsigned)&T2CON*8)+3;
static          near bit	T2OUTPS1	@ ((unsigned)&T2CON*8)+4;
static          near bit	T2OUTPS2	@ ((unsigned)&T2CON*8)+5;
static          near bit	T2OUTPS3	@ ((unsigned)&T2CON*8)+6;

/* Definitions for SSP1STAT register */
static volatile near bit	BF		@ ((unsigned)&SSP1STAT*8)+0;
static volatile near bit	UA		@ ((unsigned)&SSP1STAT*8)+1;
static volatile near bit	RW		@ ((unsigned)&SSP1STAT*8)+2;
static volatile near bit	START		@ ((unsigned)&SSP1STAT*8)+3;
static volatile near bit	STOP		@ ((unsigned)&SSP1STAT*8)+4;
static volatile near bit	DA		@ ((unsigned)&SSP1STAT*8)+5;
static          near bit	CKE		@ ((unsigned)&SSP1STAT*8)+6;
static          near bit	SMP		@ ((unsigned)&SSP1STAT*8)+7;
/* Alternate definitions for SSP1STAT register */
static volatile near bit	BF1		@ ((unsigned)&SSP1STAT*8)+0;
static volatile near bit	UA1		@ ((unsigned)&SSP1STAT*8)+1;
static volatile near bit	RW1		@ ((unsigned)&SSP1STAT*8)+2;
static volatile near bit	START1		@ ((unsigned)&SSP1STAT*8)+3;
static volatile near bit	STOP1		@ ((unsigned)&SSP1STAT*8)+4;
static volatile near bit	DA1		@ ((unsigned)&SSP1STAT*8)+5;
static          near bit	CKE1		@ ((unsigned)&SSP1STAT*8)+6;
static          near bit	SMP1		@ ((unsigned)&SSP1STAT*8)+7;

/* Definitions for SSP1CON1 register */
static          near bit	SSPM0		@ ((unsigned)&SSP1CON1*8)+0;
static          near bit	SSPM1		@ ((unsigned)&SSP1CON1*8)+1;
static          near bit	SSPM2		@ ((unsigned)&SSP1CON1*8)+2;
static          near bit	SSPM3		@ ((unsigned)&SSP1CON1*8)+3;
static          near bit	CKP		@ ((unsigned)&SSP1CON1*8)+4;
static          near bit	SSPEN		@ ((unsigned)&SSP1CON1*8)+5;
static volatile near bit	SSPOV		@ ((unsigned)&SSP1CON1*8)+6;
static volatile near bit	WCOL		@ ((unsigned)&SSP1CON1*8)+7;
/* Alternate definitions for SSP1CON1 register */
static          near bit	SSPM01		@ ((unsigned)&SSP1CON1*8)+0;
static          near bit	SSPM11		@ ((unsigned)&SSP1CON1*8)+1;
static          near bit	SSPM21		@ ((unsigned)&SSP1CON1*8)+2;
static          near bit	SSPM31		@ ((unsigned)&SSP1CON1*8)+3;
static          near bit	CKP1		@ ((unsigned)&SSP1CON1*8)+4;
static          near bit	SSPEN1		@ ((unsigned)&SSP1CON1*8)+5;
static volatile near bit	SSPOV1		@ ((unsigned)&SSP1CON1*8)+6;
static volatile near bit	WCOL1		@ ((unsigned)&SSP1CON1*8)+7;

/* Definitions for SSP1CON2 register */
static          near bit	SEN		@ ((unsigned)&SSP1CON2*8)+0;
static volatile near bit	RSEN		@ ((unsigned)&SSP1CON2*8)+1;
static volatile near bit	PEN		@ ((unsigned)&SSP1CON2*8)+2;
static volatile near bit	RCEN		@ ((unsigned)&SSP1CON2*8)+3;
static volatile near bit	ACKEN		@ ((unsigned)&SSP1CON2*8)+4;
static volatile near bit	ACKDT		@ ((unsigned)&SSP1CON2*8)+5;
static volatile near bit	ACKSTAT		@ ((unsigned)&SSP1CON2*8)+6;
static          near bit	GCEN		@ ((unsigned)&SSP1CON2*8)+7;
/* Alternate definitions for SSP1CON2 register */
static          near bit	SEN1		@ ((unsigned)&SSP1CON2*8)+0;
static volatile near bit	RSEN1		@ ((unsigned)&SSP1CON2*8)+1;
static volatile near bit	PEN1		@ ((unsigned)&SSP1CON2*8)+2;
static volatile near bit	RCEN1		@ ((unsigned)&SSP1CON2*8)+3;
static volatile near bit	ACKEN1		@ ((unsigned)&SSP1CON2*8)+4;
static volatile near bit	ACKDT1		@ ((unsigned)&SSP1CON2*8)+5;
static volatile near bit	ACKSTAT1	@ ((unsigned)&SSP1CON2*8)+6;
static          near bit	GCEN1		@ ((unsigned)&SSP1CON2*8)+7;

