wkk0912/pic18f6621modify/pic18fxx22.h
/* Definitions for ADCON0 register */
static          near bit	ADON		@ ((unsigned)&ADCON0*8)+0;
static volatile near bit	GODONE		@ ((unsigned)&ADCON0*8)+1;
static          near bit	CHS0		@ ((unsigned)&ADCON0*8)+2;
static          near bit	CHS1		@ ((unsigned)&ADCON0*8)+3;
static          near bit	CHS2		@ ((unsigned)&ADCON0*8)+4;
static          near bit	CHS3		@ ((unsigned)&ADCON0*8)+5;

/* Definitions for ADCON1 register */
static          near bit	PCFG0		@ ((unsigned)&ADCON1*8)+0;
static          near bit	PCFG1		@ ((unsigned)&ADCON1*8)+1;
static          near bit	PCFG2		@ ((unsigned)&ADCON1*8)+2;
static          near bit	PCFG3		@ ((unsigned)&ADCON1*8)+3;
static          near bit	VCFG0		@ ((unsigned)&ADCON1*8)+4;
static          near bit	VCFG1		@ ((unsigned)&ADCON1*8)+5;

/* Definitions for ADCON2 register */
static          near bit	ADCS0		@ ((unsigned)&ADCON2*8)+0;
static          near bit	ADCS1		@ ((unsigned)&ADCON2*8)+1;
static          near bit	ADCS2		@ ((unsigned)&ADCON2*8)+2;
static          near bit	ACQT0		@ ((unsigned)&ADCON2*8)+3;
static          near bit	ACQT1		@ ((unsigned)&ADCON2*8)+4;
static          near bit	ACQT2		@ ((unsigned)&ADCON2*8)+5;
static          near bit	ADFM		@ ((unsigned)&ADCON2*8)+7;

/* Definitions for CCP1CON register */
static          near bit	CCP1M0		@ ((unsigned)&CCP1CON*8)+0;
static          near bit	CCP1M1		@ ((unsigned)&CCP1CON*8)+1;
static          near bit	CCP1M2		@ ((unsigned)&CCP1CON*8)+2;
static          near bit	CCP1M3		@ ((unsigned)&CCP1CON*8)+3;
static          near bit	DC1B0		@ ((unsigned)&CCP1CON*8)+4;
static          near bit	DC1B1		@ ((unsigned)&CCP1CON*8)+5;
static          near bit	P1M0		@ ((unsigned)&CCP1CON*8)+6;
static          near bit	P1M1		@ ((unsigned)&CCP1CON*8)+7;

/* Definitions for CCP2CON register */
static          near bit	CCP2M0		@ ((unsigned)&CCP2CON*8)+0;
static          near bit	CCP2M1		@ ((unsigned)&CCP2CON*8)+1;
static          near bit	CCP2M2		@ ((unsigned)&CCP2CON*8)+2;
static          near bit	CCP2M3		@ ((unsigned)&CCP2CON*8)+3;
static          near bit	DC2B0		@ ((unsigned)&CCP2CON*8)+4;
static          near bit	DC2B1		@ ((unsigned)&CCP2CON*8)+5;
static          near bit	P2M0		@ ((unsigned)&CCP2CON*8)+6;
static          near bit	P2M1		@ ((unsigned)&CCP2CON*8)+7;

/* Definitions for CCP3CON register */
static          near bit	CCP3M0		@ ((unsigned)&CCP3CON*8)+0;
static          near bit	CCP3M1		@ ((unsigned)&CCP3CON*8)+1;
static          near bit	CCP3M2		@ ((unsigned)&CCP3CON*8)+2;
static          near bit	CCP3M3		@ ((unsigned)&CCP3CON*8)+3;
static          near bit	DC3B0		@ ((unsigned)&CCP3CON*8)+4;
static          near bit	DC3B1		@ ((unsigned)&CCP3CON*8)+5;
static          near bit	P3M0		@ ((unsigned)&CCP3CON*8)+6;
static          near bit	P3M1		@ ((unsigned)&CCP3CON*8)+7;

#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
/* Definitions for ECCP1AS register */
static          near bit	PSS1BD0		@ ((unsigned)&ECCP1AS*8)+0;
static          near bit	PSS1BD1		@ ((unsigned)&ECCP1AS*8)+1;
static          near bit	PSS1AC0		@ ((unsigned)&ECCP1AS*8)+2;
static          near bit	PSS1AC1		@ ((unsigned)&ECCP1AS*8)+3;
static          near bit	ECCP1AS0	@ ((unsigned)&ECCP1AS*8)+4;
static          near bit	ECCP1AS1	@ ((unsigned)&ECCP1AS*8)+5;
static          near bit	ECCP1AS2	@ ((unsigned)&ECCP1AS*8)+6;
static volatile near bit	ECCP1ASE	@ ((unsigned)&ECCP1AS*8)+7;
#endif

/* Definitions for CVRCON register */
static          near bit	CVR0		@ ((unsigned)&CVRCON*8)+0;
static          near bit	CVR1		@ ((unsigned)&CVRCON*8)+1;
static          near bit	CVR2		@ ((unsigned)&CVRCON*8)+2;
static          near bit	CVR3		@ ((unsigned)&CVRCON*8)+3;
static          near bit	CVRSS		@ ((unsigned)&CVRCON*8)+4;
static          near bit	CVRR		@ ((unsigned)&CVRCON*8)+5;
static          near bit	CVROE		@ ((unsigned)&CVRCON*8)+6;
static          near bit	CVREN		@ ((unsigned)&CVRCON*8)+7;

/* Definitions for CMCON register */
static          near bit	CM0		@ ((unsigned)&CMCON*8)+0;
static          near bit	CM1		@ ((unsigned)&CMCON*8)+1;
static          near bit	CM2		@ ((unsigned)&CMCON*8)+2;
static          near bit	CIS		@ ((unsigned)&CMCON*8)+3;
static          near bit	C1INV		@ ((unsigned)&CMCON*8)+4;
static          near bit	C2INV		@ ((unsigned)&CMCON*8)+5;
static volatile near bit	C1OUT		@ ((unsigned)&CMCON*8)+6;
static volatile near bit	C2OUT		@ ((unsigned)&CMCON*8)+7;

/* Definitions for T3CON register */
static          near bit	TMR3ON		@ ((unsigned)&T3CON*8)+0;
static          near bit	TMR3CS		@ ((unsigned)&T3CON*8)+1;
static          near bit	T3SYNC		@ ((unsigned)&T3CON*8)+2;
static          near bit	T3CCP1		@ ((unsigned)&T3CON*8)+3;
static          near bit	T3CKPS0		@ ((unsigned)&T3CON*8)+4;
static          near bit	T3CKPS1		@ ((unsigned)&T3CON*8)+5;
static          near bit	T3CCP2		@ ((unsigned)&T3CON*8)+6;
static          near bit	T3RD16		@ ((unsigned)&T3CON*8)+7;

/* Definitions for PSPCON register */
static          near bit	PSPMODE		@ ((unsigned)&PSPCON*8)+4;
static volatile near bit	IBOV		@ ((unsigned)&PSPCON*8)+5;
static volatile near bit	OBF		@ ((unsigned)&PSPCON*8)+6;
static volatile near bit	IBF		@ ((unsigned)&PSPCON*8)+7;

/* Definitions for TXSTA1 register */
static volatile near bit	TX9D		@ ((unsigned)&TXSTA1*8)+0;
static volatile near bit	TRMT		@ ((unsigned)&TXSTA1*8)+1;
static          near bit	BRGH		@ ((unsigned)&TXSTA1*8)+2;
static          near bit	SENDB		@ ((unsigned)&TXSTA1*8)+3;
static          near bit	SYNC		@ ((unsigned)&TXSTA1*8)+4;
static          near bit	TXEN		@ ((unsigned)&TXSTA1*8)+5;
static          near bit	TX9		@ ((unsigned)&TXSTA1*8)+6;
static          near bit	CSRC		@ ((unsigned)&TXSTA1*8)+7;

/* Definitions for RCSTA1 register */
static volatile near bit	RX9D		@ ((unsigned)&RCSTA1*8)+0;
static volatile near bit	OERR		@ ((unsigned)&RCSTA1*8)+1;
static volatile near bit	FERR		@ ((unsigned)&RCSTA1*8)+2;
static          near bit	ADDEN		@ ((unsigned)&RCSTA1*8)+3;
static          near bit	CREN		@ ((unsigned)&RCSTA1*8)+4;
static          near bit	SREN		@ ((unsigned)&RCSTA1*8)+5;
static          near bit	RX9		@ ((unsigned)&RCSTA1*8)+6;
static          near bit	SPEN		@ ((unsigned)&RCSTA1*8)+7;

