wkk0912/pic18f6621modify/pic18fxx22.h
/* Definitions for EECON1 register */
static volatile near bit	RD		@ ((unsigned)&EECON1*8)+0;
static volatile near bit	WR		@ ((unsigned)&EECON1*8)+1;
static          near bit	WREN		@ ((unsigned)&EECON1*8)+2;
static volatile near bit	WRERR		@ ((unsigned)&EECON1*8)+3;
static volatile near bit	FREE		@ ((unsigned)&EECON1*8)+4;
static          near bit	CFGS		@ ((unsigned)&EECON1*8)+6;
static          near bit	EEPGD		@ ((unsigned)&EECON1*8)+7;

/* Definitions for IPR3 register */
static          near bit	CCP3IP		@ ((unsigned)&IPR3*8)+0;
static          near bit	CCP4IP		@ ((unsigned)&IPR3*8)+1;
static          near bit	CCP5IP		@ ((unsigned)&IPR3*8)+2;
static          near bit	TMR4IP		@ ((unsigned)&IPR3*8)+3;
static          near bit	TX2IP		@ ((unsigned)&IPR3*8)+4;
static          near bit	RC2IP		@ ((unsigned)&IPR3*8)+5;
static          near bit	BCL2IP		@ ((unsigned)&IPR3*8)+6;
static          near bit	SSP2IP		@ ((unsigned)&IPR3*8)+7;

/* Definitions for PIR3 register */
static volatile near bit	CCP3IF		@ ((unsigned)&PIR3*8)+0;
static volatile near bit	CCP4IF		@ ((unsigned)&PIR3*8)+1;
static volatile near bit	CCP5IF		@ ((unsigned)&PIR3*8)+2;
static volatile near bit	TMR4IF		@ ((unsigned)&PIR3*8)+3;
static volatile near bit	TX2IF		@ ((unsigned)&PIR3*8)+4;
static volatile near bit	RC2IF		@ ((unsigned)&PIR3*8)+5;
static volatile near bit	BCL2IF		@ ((unsigned)&PIR3*8)+6;
static volatile near bit	SSP2IF		@ ((unsigned)&PIR3*8)+7;

/* Definitions for PIE3 register */
static          near bit	CCP3IE		@ ((unsigned)&PIE3*8)+0;
static          near bit	CCP4IE		@ ((unsigned)&PIE3*8)+1;
static          near bit	CCP5IE		@ ((unsigned)&PIE3*8)+2;
static          near bit	TMR4IE		@ ((unsigned)&PIE3*8)+3;
static          near bit	TX2IE		@ ((unsigned)&PIE3*8)+4;
static          near bit	RC2IE		@ ((unsigned)&PIE3*8)+5;
static          near bit	BCL2IE		@ ((unsigned)&PIE3*8)+6;
static          near bit	SSP2IE		@ ((unsigned)&PIE3*8)+7;

/* Definitions for IPR2 register */
static          near bit	CCP2IP		@ ((unsigned)&IPR2*8)+0;
static          near bit	TMR3IP		@ ((unsigned)&IPR2*8)+1;
static          near bit	HLVDIP		@ ((unsigned)&IPR2*8)+2;
static          near bit	BCL1IP		@ ((unsigned)&IPR2*8)+3;
static          near bit	EEIP		@ ((unsigned)&IPR2*8)+4;
static          near bit	CMIP		@ ((unsigned)&IPR2*8)+6;
static          near bit	OSCFIP		@ ((unsigned)&IPR2*8)+7;

/* Definitions for PIR2 register */
static volatile near bit	CCP2IF		@ ((unsigned)&PIR2*8)+0;
static volatile near bit	TMR3IF		@ ((unsigned)&PIR2*8)+1;
static volatile near bit	HLVDIF		@ ((unsigned)&PIR2*8)+2;
static volatile near bit	BCL1IF		@ ((unsigned)&PIR2*8)+3;
static volatile near bit	EEIF		@ ((unsigned)&PIR2*8)+4;
static volatile near bit	CMIF		@ ((unsigned)&PIR2*8)+6;
static volatile near bit	OSCFIF		@ ((unsigned)&PIR2*8)+7;

/* Definitions for PIE2 register */
static          near bit	CCP2IE		@ ((unsigned)&PIE2*8)+0;
static          near bit	TMR3IE		@ ((unsigned)&PIE2*8)+1;
static          near bit	HLVDIE		@ ((unsigned)&PIE2*8)+2;
static          near bit	BCL1IE		@ ((unsigned)&PIE2*8)+3;
static          near bit	EEIE		@ ((unsigned)&PIE2*8)+4;
static          near bit	CMIE		@ ((unsigned)&PIE2*8)+6;
static          near bit	OSCFIE		@ ((unsigned)&PIE2*8)+7;

/* Definitions for IPR1 register */
static          near bit	TMR1IP		@ ((unsigned)&IPR1*8)+0;
static          near bit	TMR2IP		@ ((unsigned)&IPR1*8)+1;
static          near bit	CCP1IP		@ ((unsigned)&IPR1*8)+2;
static          near bit	SSP1IP		@ ((unsigned)&IPR1*8)+3;
static          near bit	TX1IP		@ ((unsigned)&IPR1*8)+4;
static          near bit	RC1IP		@ ((unsigned)&IPR1*8)+5;
static          near bit	ADIP		@ ((unsigned)&IPR1*8)+6;
static          near bit	PSPIP		@ ((unsigned)&IPR1*8)+7;

/* Definitions for PIR1 register */
static volatile near bit	TMR1IF		@ ((unsigned)&PIR1*8)+0;
static volatile near bit	TMR2IF		@ ((unsigned)&PIR1*8)+1;
static volatile near bit	CCP1IF		@ ((unsigned)&PIR1*8)+2;
static volatile near bit	SSP1IF		@ ((unsigned)&PIR1*8)+3;
static volatile near bit	TX1IF		@ ((unsigned)&PIR1*8)+4;
static volatile near bit	RC1IF		@ ((unsigned)&PIR1*8)+5;
static volatile near bit	ADIF		@ ((unsigned)&PIR1*8)+6;
static volatile near bit	PSPIF		@ ((unsigned)&PIR1*8)+7;

/* Definitions for PIE1 register */
static          near bit	TMR1IE		@ ((unsigned)&PIE1*8)+0;
static          near bit	TMR2IE		@ ((unsigned)&PIE1*8)+1;
static          near bit	CCP1IE		@ ((unsigned)&PIE1*8)+2;
static          near bit	SSP1IE		@ ((unsigned)&PIE1*8)+3;
static          near bit	TX1IE		@ ((unsigned)&PIE1*8)+4;
static          near bit	RC1IE		@ ((unsigned)&PIE1*8)+5;
static          near bit	ADIE		@ ((unsigned)&PIE1*8)+6;
static          near bit	PSPIE		@ ((unsigned)&PIE1*8)+7;

#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
/* Definitions for MEMCON register */
static          near bit	WM0		@ ((unsigned)&MEMCON*8)+0;
static          near bit	WM1		@ ((unsigned)&MEMCON*8)+1;
static          near bit	WAIT0		@ ((unsigned)&MEMCON*8)+4;
static          near bit	WAIT1		@ ((unsigned)&MEMCON*8)+5;
static          near bit	EBDIS		@ ((unsigned)&MEMCON*8)+7;
#endif

/* Definitions for OSCTUNE register */
static          near bit	TUN0		@ ((unsigned)&OSCTUNE*8)+0;
static          near bit	TUN1		@ ((unsigned)&OSCTUNE*8)+1;
static          near bit	TUN2		@ ((unsigned)&OSCTUNE*8)+2;
static          near bit	TUN3		@ ((unsigned)&OSCTUNE*8)+3;
static          near bit	TUN4		@ ((unsigned)&OSCTUNE*8)+4;
static          near bit	PLLEN		@ ((unsigned)&OSCTUNE*8)+6;
static          near bit	INTSRC		@ ((unsigned)&OSCTUNE*8)+7;

#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
/* Definitions for TRISJ register */
static volatile near bit	TRISJ0		@ ((unsigned)&TRISJ*8)+0;
static volatile near bit	TRISJ1		@ ((unsigned)&TRISJ*8)+1;
static volatile near bit	TRISJ2		@ ((unsigned)&TRISJ*8)+2;
static volatile near bit	TRISJ3		@ ((unsigned)&TRISJ*8)+3;
static volatile near bit	TRISJ4		@ ((unsigned)&TRISJ*8)+4;
static volatile near bit	TRISJ5		@ ((unsigned)&TRISJ*8)+5;
static volatile near bit	TRISJ6		@ ((unsigned)&TRISJ*8)+6;
static volatile near bit	TRISJ7		@ ((unsigned)&TRISJ*8)+7;

/* Definitions for TRISH register */
static volatile near bit	TRISH0		@ ((unsigned)&TRISH*8)+0;
static volatile near bit	TRISH1		@ ((unsigned)&TRISH*8)+1;
static volatile near bit	TRISH2		@ ((unsigned)&TRISH*8)+2;
static volatile near bit	TRISH3		@ ((unsigned)&TRISH*8)+3;
static volatile near bit	TRISH4		@ ((unsigned)&TRISH*8)+4;
static volatile near bit	TRISH5		@ ((unsigned)&TRISH*8)+5;
static volatile near bit	TRISH6		@ ((unsigned)&TRISH*8)+6;
static volatile near bit	TRISH7		@ ((unsigned)&TRISH*8)+7;
#endif

