wkk0912/pic18f6621modify/pic18fxx22.h
/* Definitions for TRISG register */
static volatile near bit	TRISG0		@ ((unsigned)&TRISG*8)+0;
static volatile near bit	TRISG1		@ ((unsigned)&TRISG*8)+1;
static volatile near bit	TRISG2		@ ((unsigned)&TRISG*8)+2;
static volatile near bit	TRISG3		@ ((unsigned)&TRISG*8)+3;
static volatile near bit	TRISG4		@ ((unsigned)&TRISG*8)+4;

/* Definitions for TRISF register */
static volatile near bit	TRISF0		@ ((unsigned)&TRISF*8)+0;
static volatile near bit	TRISF1		@ ((unsigned)&TRISF*8)+1;
static volatile near bit	TRISF2		@ ((unsigned)&TRISF*8)+2;
static volatile near bit	TRISF3		@ ((unsigned)&TRISF*8)+3;
static volatile near bit	TRISF4		@ ((unsigned)&TRISF*8)+4;
static volatile near bit	TRISF5		@ ((unsigned)&TRISF*8)+5;
static volatile near bit	TRISF6		@ ((unsigned)&TRISF*8)+6;
static volatile near bit	TRISF7		@ ((unsigned)&TRISF*8)+7;

/* Definitions for TRISE register */
static volatile near bit	TRISE0		@ ((unsigned)&TRISE*8)+0;
static volatile near bit	TRISE1		@ ((unsigned)&TRISE*8)+1;
static volatile near bit	TRISE2		@ ((unsigned)&TRISE*8)+2;
static volatile near bit	TRISE3		@ ((unsigned)&TRISE*8)+3;
static volatile near bit	TRISE4		@ ((unsigned)&TRISE*8)+4;
static volatile near bit	TRISE5		@ ((unsigned)&TRISE*8)+5;
static volatile near bit	TRISE6		@ ((unsigned)&TRISE*8)+6;
static volatile near bit	TRISE7		@ ((unsigned)&TRISE*8)+7;

/* Definitions for TRISD register */
static volatile near bit	TRISD0		@ ((unsigned)&TRISD*8)+0;
static volatile near bit	TRISD1		@ ((unsigned)&TRISD*8)+1;
static volatile near bit	TRISD2		@ ((unsigned)&TRISD*8)+2;
static volatile near bit	TRISD3		@ ((unsigned)&TRISD*8)+3;
static volatile near bit	TRISD4		@ ((unsigned)&TRISD*8)+4;
static volatile near bit	TRISD5		@ ((unsigned)&TRISD*8)+5;
static volatile near bit	TRISD6		@ ((unsigned)&TRISD*8)+6;
static volatile near bit	TRISD7		@ ((unsigned)&TRISD*8)+7;

/* Definitions for TRISC register */
static volatile near bit	TRISC0		@ ((unsigned)&TRISC*8)+0;
static volatile near bit	TRISC1		@ ((unsigned)&TRISC*8)+1;
static volatile near bit	TRISC2		@ ((unsigned)&TRISC*8)+2;
static volatile near bit	TRISC3		@ ((unsigned)&TRISC*8)+3;
static volatile near bit	TRISC4		@ ((unsigned)&TRISC*8)+4;
static volatile near bit	TRISC5		@ ((unsigned)&TRISC*8)+5;
static volatile near bit	TRISC6		@ ((unsigned)&TRISC*8)+6;
static volatile near bit	TRISC7		@ ((unsigned)&TRISC*8)+7;

/* Definitions for TRISB register */
static volatile near bit	TRISB0		@ ((unsigned)&TRISB*8)+0;
static volatile near bit	TRISB1		@ ((unsigned)&TRISB*8)+1;
static volatile near bit	TRISB2		@ ((unsigned)&TRISB*8)+2;
static volatile near bit	TRISB3		@ ((unsigned)&TRISB*8)+3;
static volatile near bit	TRISB4		@ ((unsigned)&TRISB*8)+4;
static volatile near bit	TRISB5		@ ((unsigned)&TRISB*8)+5;
static volatile near bit	TRISB6		@ ((unsigned)&TRISB*8)+6;
static volatile near bit	TRISB7		@ ((unsigned)&TRISB*8)+7;

/* Definitions for TRISA register */
static volatile near bit	TRISA0		@ ((unsigned)&TRISA*8)+0;
static volatile near bit	TRISA1		@ ((unsigned)&TRISA*8)+1;
static volatile near bit	TRISA2		@ ((unsigned)&TRISA*8)+2;
static volatile near bit	TRISA3		@ ((unsigned)&TRISA*8)+3;
static volatile near bit	TRISA4		@ ((unsigned)&TRISA*8)+4;
static volatile near bit	TRISA5		@ ((unsigned)&TRISA*8)+5;
static volatile near bit	TRISA6		@ ((unsigned)&TRISA*8)+6;
static volatile near bit	TRISA7		@ ((unsigned)&TRISA*8)+7;

#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
/* Definitions for LATJ register */
static volatile near bit	LATJ0		@ ((unsigned)&LATJ*8)+0;
static volatile near bit	LATJ1		@ ((unsigned)&LATJ*8)+1;
static volatile near bit	LATJ2		@ ((unsigned)&LATJ*8)+2;
static volatile near bit	LATJ3		@ ((unsigned)&LATJ*8)+3;
static volatile near bit	LATJ4		@ ((unsigned)&LATJ*8)+4;
static volatile near bit	LATJ5		@ ((unsigned)&LATJ*8)+5;
static volatile near bit	LATJ6		@ ((unsigned)&LATJ*8)+6;
static volatile near bit	LATJ7		@ ((unsigned)&LATJ*8)+7;

/* Definitions for LATH register */
static volatile near bit	LATH0		@ ((unsigned)&LATH*8)+0;
static volatile near bit	LATH1		@ ((unsigned)&LATH*8)+1;
static volatile near bit	LATH2		@ ((unsigned)&LATH*8)+2;
static volatile near bit	LATH3		@ ((unsigned)&LATH*8)+3;
static volatile near bit	LATH4		@ ((unsigned)&LATH*8)+4;
static volatile near bit	LATH5		@ ((unsigned)&LATH*8)+5;
static volatile near bit	LATH6		@ ((unsigned)&LATH*8)+6;
static volatile near bit	LATH7		@ ((unsigned)&LATH*8)+7;
#endif

/* Definitions for LATG register */
static volatile near bit	LATG0		@ ((unsigned)&LATG*8)+0;
static volatile near bit	LATG1		@ ((unsigned)&LATG*8)+1;
static volatile near bit	LATG2		@ ((unsigned)&LATG*8)+2;
static volatile near bit	LATG3		@ ((unsigned)&LATG*8)+3;
static volatile near bit	LATG4		@ ((unsigned)&LATG*8)+4;

/* Definitions for LATF register */
static volatile near bit	LATF0		@ ((unsigned)&LATF*8)+0;
static volatile near bit	LATF1		@ ((unsigned)&LATF*8)+1;
static volatile near bit	LATF2		@ ((unsigned)&LATF*8)+2;
static volatile near bit	LATF3		@ ((unsigned)&LATF*8)+3;
static volatile near bit	LATF4		@ ((unsigned)&LATF*8)+4;
static volatile near bit	LATF5		@ ((unsigned)&LATF*8)+5;
static volatile near bit	LATF6		@ ((unsigned)&LATF*8)+6;
static volatile near bit	LATF7		@ ((unsigned)&LATF*8)+7;

/* Definitions for LATE register */
static volatile near bit	LATE0		@ ((unsigned)&LATE*8)+0;
static volatile near bit	LATE1		@ ((unsigned)&LATE*8)+1;
static volatile near bit	LATE2		@ ((unsigned)&LATE*8)+2;
static volatile near bit	LATE3		@ ((unsigned)&LATE*8)+3;
static volatile near bit	LATE4		@ ((unsigned)&LATE*8)+4;
static volatile near bit	LATE5		@ ((unsigned)&LATE*8)+5;
static volatile near bit	LATE6		@ ((unsigned)&LATE*8)+6;
static volatile near bit	LATE7		@ ((unsigned)&LATE*8)+7;

/* Definitions for LATD register */
static volatile near bit	LATD0		@ ((unsigned)&LATD*8)+0;
static volatile near bit	LATD1		@ ((unsigned)&LATD*8)+1;
static volatile near bit	LATD2		@ ((unsigned)&LATD*8)+2;
static volatile near bit	LATD3		@ ((unsigned)&LATD*8)+3;
static volatile near bit	LATD4		@ ((unsigned)&LATD*8)+4;
static volatile near bit	LATD5		@ ((unsigned)&LATD*8)+5;
static volatile near bit	LATD6		@ ((unsigned)&LATD*8)+6;
static volatile near bit	LATD7		@ ((unsigned)&LATD*8)+7;

/* Definitions for LATC register */
static volatile near bit	LATC0		@ ((unsigned)&LATC*8)+0;
static volatile near bit	LATC1		@ ((unsigned)&LATC*8)+1;
static volatile near bit	LATC2		@ ((unsigned)&LATC*8)+2;
static volatile near bit	LATC3		@ ((unsigned)&LATC*8)+3;
static volatile near bit	LATC4		@ ((unsigned)&LATC*8)+4;
static volatile near bit	LATC5		@ ((unsigned)&LATC*8)+5;
static volatile near bit	LATC6		@ ((unsigned)&LATC*8)+6;
static volatile near bit	LATC7		@ ((unsigned)&LATC*8)+7;

