wkk0912/pic18f6621modify/pic18fxx22.h
/* Definitions for T4CON register */
static          near bit	T4CKPS0		@ ((unsigned)&T4CON*8)+0;
static          near bit	T4CKPS1		@ ((unsigned)&T4CON*8)+1;
static          near bit	TMR4ON		@ ((unsigned)&T4CON*8)+2;
static          near bit	T4OUTPS0	@ ((unsigned)&T4CON*8)+3;
static          near bit	T4OUTPS1	@ ((unsigned)&T4CON*8)+4;
static          near bit	T4OUTPS2	@ ((unsigned)&T4CON*8)+5;
static          near bit	T4OUTPS3	@ ((unsigned)&T4CON*8)+6;

/* Definitions for CCP4CON register */
static          near bit	CCP4M0		@ ((unsigned)&CCP4CON*8)+0;
static          near bit	CCP4M1		@ ((unsigned)&CCP4CON*8)+1;
static          near bit	CCP4M2		@ ((unsigned)&CCP4CON*8)+2;
static          near bit	CCP4M3		@ ((unsigned)&CCP4CON*8)+3;
static          near bit	DC4B0		@ ((unsigned)&CCP4CON*8)+4;
static          near bit	DC4B1		@ ((unsigned)&CCP4CON*8)+5;

/* Definitions for CCP5CON register */
static          near bit	CCP5M0		@ ((unsigned)&CCP5CON*8)+0;
static          near bit	CCP5M1		@ ((unsigned)&CCP5CON*8)+1;
static          near bit	CCP5M2		@ ((unsigned)&CCP5CON*8)+2;
static          near bit	CCP5M3		@ ((unsigned)&CCP5CON*8)+3;
static          near bit	DC5B0		@ ((unsigned)&CCP5CON*8)+4;
static          near bit	DC5B1		@ ((unsigned)&CCP5CON*8)+5;

/* Definitions for TXSTA2 register */
static volatile near bit	TX9D2		@ ((unsigned)&TXSTA2*8)+0;
static volatile near bit	TRMT2		@ ((unsigned)&TXSTA2*8)+1;
static          near bit	BRGH2		@ ((unsigned)&TXSTA2*8)+2;
static          near bit	SENDB2		@ ((unsigned)&TXSTA2*8)+3;
static          near bit	SYNC2		@ ((unsigned)&TXSTA2*8)+4;
static          near bit	TXEN2		@ ((unsigned)&TXSTA2*8)+5;
static          near bit	TX92		@ ((unsigned)&TXSTA2*8)+6;
static          near bit	CSRC2		@ ((unsigned)&TXSTA2*8)+7;

/* Definitions for RCSTA2 register */
static volatile near bit	RX9D2		@ ((unsigned)&RCSTA2*8)+0;
static volatile near bit	OERR2		@ ((unsigned)&RCSTA2*8)+1;
static volatile near bit	FERR2		@ ((unsigned)&RCSTA2*8)+2;
static          near bit	ADDEN2		@ ((unsigned)&RCSTA2*8)+3;
static          near bit	CREN2		@ ((unsigned)&RCSTA2*8)+4;
static          near bit	SREN2		@ ((unsigned)&RCSTA2*8)+5;
static          near bit	RX92		@ ((unsigned)&RCSTA2*8)+6;
static          near bit	SPEN2		@ ((unsigned)&RCSTA2*8)+7;

/* Definitions for ECCP3AS register */
static          near bit	PSS3BD0		@ ((unsigned)&ECCP3AS*8)+0;
static          near bit	PSS3BD1		@ ((unsigned)&ECCP3AS*8)+1;
static          near bit	PSS3AC0		@ ((unsigned)&ECCP3AS*8)+2;
static          near bit	PSS3AC1		@ ((unsigned)&ECCP3AS*8)+3;
static          near bit	ECCP3AS0	@ ((unsigned)&ECCP3AS*8)+4;
static          near bit	ECCP3AS1	@ ((unsigned)&ECCP3AS*8)+5;
static          near bit	ECCP3AS2	@ ((unsigned)&ECCP3AS*8)+6;
static volatile near bit	ECCP3ASE	@ ((unsigned)&ECCP3AS*8)+7;

/* Definitions for ECCP3DEL register */
static          near bit	P3DC0		@ ((unsigned)&ECCP3DEL*8)+0;
static          near bit	P3DC1		@ ((unsigned)&ECCP3DEL*8)+1;
static          near bit	P3DC2		@ ((unsigned)&ECCP3DEL*8)+2;
static          near bit	P3DC3		@ ((unsigned)&ECCP3DEL*8)+3;
static          near bit	P3DC4		@ ((unsigned)&ECCP3DEL*8)+4;
static          near bit	P3DC5		@ ((unsigned)&ECCP3DEL*8)+5;
static          near bit	P3DC6		@ ((unsigned)&ECCP3DEL*8)+6;
static          near bit	P3RSEN		@ ((unsigned)&ECCP3DEL*8)+7;

/* Definitions for ECCP2AS register */
static          near bit	PSS2BD0		@ ((unsigned)&ECCP2AS*8)+0;
static          near bit	PSS2BD1		@ ((unsigned)&ECCP2AS*8)+1;
static          near bit	PSS2AC0		@ ((unsigned)&ECCP2AS*8)+2;
static          near bit	PSS2AC1		@ ((unsigned)&ECCP2AS*8)+3;
static          near bit	ECCP2AS0	@ ((unsigned)&ECCP2AS*8)+4;
static          near bit	ECCP2AS1	@ ((unsigned)&ECCP2AS*8)+5;
static          near bit	ECCP2AS2	@ ((unsigned)&ECCP2AS*8)+6;
static volatile near bit	ECCP2ASE	@ ((unsigned)&ECCP2AS*8)+7;

/* Definitions for ECCP2DEL register */
static          near bit	P2DC0		@ ((unsigned)&ECCP2DEL*8)+0;
static          near bit	P2DC1		@ ((unsigned)&ECCP2DEL*8)+1;
static          near bit	P2DC2		@ ((unsigned)&ECCP2DEL*8)+2;
static          near bit	P2DC3		@ ((unsigned)&ECCP2DEL*8)+3;
static          near bit	P2DC4		@ ((unsigned)&ECCP2DEL*8)+4;
static          near bit	P2DC5		@ ((unsigned)&ECCP2DEL*8)+5;
static          near bit	P2DC6		@ ((unsigned)&ECCP2DEL*8)+6;
static          near bit	P2RSEN		@ ((unsigned)&ECCP2DEL*8)+7;

/* Definitions for SSP2STAT register */
static volatile near bit	BF2		@ ((unsigned)&SSP2STAT*8)+0;
static volatile near bit	UA2		@ ((unsigned)&SSP2STAT*8)+1;
static volatile near bit	RW2		@ ((unsigned)&SSP2STAT*8)+2;
static volatile near bit	START2		@ ((unsigned)&SSP2STAT*8)+3;
static volatile near bit	STOP2		@ ((unsigned)&SSP2STAT*8)+4;
static volatile near bit	DA2		@ ((unsigned)&SSP2STAT*8)+5;
static          near bit	CKE2		@ ((unsigned)&SSP2STAT*8)+6;
static          near bit	SMP2		@ ((unsigned)&SSP2STAT*8)+7;

/* Definitions for SSP2CON1 register */
static          near bit	SSPM02		@ ((unsigned)&SSP2CON1*8)+0;
static          near bit	SSPM12		@ ((unsigned)&SSP2CON1*8)+1;
static          near bit	SSPM22		@ ((unsigned)&SSP2CON1*8)+2;
static          near bit	SSPM32		@ ((unsigned)&SSP2CON1*8)+3;
static          near bit	CKP2		@ ((unsigned)&SSP2CON1*8)+4;
static          near bit	SSPEN2		@ ((unsigned)&SSP2CON1*8)+5;
static volatile near bit	SSPOV2		@ ((unsigned)&SSP2CON1*8)+6;
static volatile near bit	WCOL2		@ ((unsigned)&SSP2CON1*8)+7;

/* Definitions for SSP2CON2 register */
static          near bit	SEN2		@ ((unsigned)&SSP2CON2*8)+0;
static volatile near bit	RSEN2		@ ((unsigned)&SSP2CON2*8)+1;
static volatile near bit	PEN2		@ ((unsigned)&SSP2CON2*8)+2;
static volatile near bit	RCEN2		@ ((unsigned)&SSP2CON2*8)+3;
static volatile near bit	ACKEN2		@ ((unsigned)&SSP2CON2*8)+4;
static volatile near bit	ACKDT2		@ ((unsigned)&SSP2CON2*8)+5;
static volatile near bit	ACKSTAT2	@ ((unsigned)&SSP2CON2*8)+6;
static          near bit	GCEN2		@ ((unsigned)&SSP2CON2*8)+7;


#define EEPROM_SIZE 1024

