wkk0912/pic18f6621modify/pic18fxx22.h
// Configuration Bit Values

// Configuration register 1H
// Oscillator
 #define EXTCLKO	0xFFFF 	// 11XX EXT RC-CLKOUT on RA6 
 #define INTCLKO	0xF9FF 	// INT RC-CLKOUT on RA6,Port on RA7 
 #define INTIO		0xF8FF 	// INT RC-Port on RA6,Port on RA7 
 #define EXTIO		0xF7FF 	// EXT RC-Port on RA6 
 #define HSPLL		0xF6FF 	// HS-PLL enabled freq=4xFosc1 
 #define ECIO		0xF5FF 	// EC-Port on RA6 
 #define ECCLKO		0xF4FF 	// EC-CLKOUT on RA6 
 #define HS		0xF2FF 	// HS Oscillator 
 #define XT		0xF1FF 	// XT Oscillator 
 #define LP		0xF0FF 	// LP Oscillator 
// Fail-Safe Clock Monitor Enable
 #define FCMDIS		0xBFFF 	// Disabled 
 #define FCMEN		0xFFFF 	// Enabled 
// Internal External Switch Over Mode
 #define IESODIS	0x7FFF 	// Disabled 
 #define IESOEN		0xFFFF 	// Enabled 

// Configuration register 2L
// Power Up Timer
 #define PWRTDIS	0xFFFF 	// Disabled 
 #define PWRTEN		0xFFFE 	// Enabled 
// Brown Out Detect
 #define BOREN		0xFFFF 	// Enabled in hardware, SBOREN disabled 
 #define BOREN_XSLP	0xFFFD 	// Enabled while active,disabled in SLEEP,SBOREN disabled 
 #define SWBOREN	0xFFFB 	// Controlled with SBOREN bit 
 #define BORDIS		0xFFF9 	// Disabled in hardware, SBOREN disabled 
// Brown Out Voltage
 #define BORV21		0xFFFF 	// 2.1V 
 #define BORV28		0xFFF7 	// 2.8V 
 #define BORV43		0xFFEF 	// 4.3V 
 #define BORV46		0xFFE7 	// 4.6V 

// Configuration register 2H
// Watchdog Timer
 #define WDTEN		0xFFFF 	// Enabled 
 #define WDTDIS		0xFEFF 	// Disabled-Controlled by SWDTEN bit 
// Watchdog Postscaler
 #define WDTPS32K	0xFFFF 	// 1:32768 
 #define WDTPS16K	0xFDFF 	// 1:16384 
 #define WDTPS8K	0xFBFF 	// 1:8192 
 #define WDTPS4K	0xF9FF 	// 1:4096 
 #define WDTPS2K	0xF7FF 	// 1:2048 
 #define WDTPS1K	0xF5FF 	// 1:1024 
 #define WDTPS512	0xF3FF 	// 1:512 
 #define WDTPS256	0xF1FF 	// 1:256 
 #define WDTPS128	0xEFFF 	// 1:128 
 #define WDTPS64	0xEDFF 	// 1:64 
 #define WDTPS32	0xEBFF 	// 1:32 
 #define WDTPS16	0xE9FF 	// 1:16 
 #define WDTPS8		0xE7FF 	// 1:8 
 #define WDTPS4		0xE5FF 	// 1:4 
 #define WDTPS2		0xE3FF 	// 1:2 
 #define WDTPS1		0xE1FF 	// 1:1 

#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
// Configuration register 3L
// External bus wait enable
 #define WAITEN		0xFF7F 	// WAIT mode active & determined by WAIT1:WAIT0 bits 
 #define WAITDIS	0xFFFF 	// WAIT mode inactive 
// External data bus width select
 #define BW16		0xFFFF 	// 16-Bit external data bus width 
 #define BW8		0xFFBF 	// 8-Bit external data bus width 
// External Address bus width select
 #define ABW20		0xFFFF 	// 20-Bit external address bus width 
 #define ABW16		0xFFEF 	// 16-Bit external address bus width 
 #define ABW12		0xFFDF 	// 12-Bit external address bus width 
 #define ABW8		0xFFCF 	// 8-Bit external address bus width 
// Processor data mode
 #define MCU		0xFFFF 	// select microcontroller mode 
 #define MPU		0xFFFE 	// select microprocessor mode 
 #define MPUBB		0xFFFD 	// select microprocessor mode with boot block mode 
 #define XMCU		0xFFFC 	// select extended microcontroller mode 
#endif

// Configuration register 3H
// CCP2 Mux
 #define CCP2RC1	0xFFFF 	// RC1 
 #define CCP2RE7	0xFEFF 	// RE7 
// if in XMCU or MPUB modes
 #define CCP2RB3	0xFEFF 	// RB3 
#if defined(_18F8527) || defined(_18F8622) || defined(_18F8627) || defined(_18F8722)
// ECCP Mux
 #define ECCPRE		0xFFFF 	// ECCP multiplexed on Port E 
 #define ECCPRH		0xFDFF 	// ECCP multiplexed on Port H 
#endif
// Low Power Timer1 Osc enable
 #define LPT1EN		0xFFFF 	// Enabled 
 #define LPT1DIS	0xFBFF 	// Disabled 
// Master Clear Enable
 #define MCLREN		0xFFFF 	// MCLR Enabled,RE3 Disabled 
 #define MCLRDIS	0x7FFF 	// MCLR Disabled,RE3 Enabled 

// Configuration register 4L
// Stack Overflow Reset
 #define STVREN		0xFFFF 	// Enabled 
 #define STVRDIS	0xFFFE 	// Disabled 
// Low voltage program enable
 #define LVPEN		0xFFFF 	// Low voltage ISP enabled 
 #define LVPDIS		0xFFFB 	// Low voltage ISP disabled 
// Extended CPU Enable
 #define XINSTEN	0xFFFF 	// Enabled 
 #define XINSTDIS	0xFFBF 	// Disabled 
// Boot block size select
 #define BBSIZ4K	0xFFFF 	// Boot block is 4K 
 #define BBSIZ2K	0xFFDF 	// Boot block is 2K 
 #define BBSIZ1K	0xFFCF 	// Boot block is 1K 
// Background Debug
 #define DEBUGDIS	0xFFFF 	// Disabled 
 #define DEBUGEN	0xFF7F 	// Enabled 

// Configuration register 5L
// Code Protection
 #define UNPROTECT	0xFFFF 	// Do not protect code 
 #define CP0		0xFFFE 	// Code Protect block 0 
 #define CP1		0xFFFD 	// Code Protect block 1 
 #define CP2		0xFFFB 	// Code Protect block 2 
#if !defined(_18F6527) && !defined(_18F8527)
 #define CP3		0xFFF7 	// Code Protect block 3 
#if !defined(_18F6622) && !defined(_18F8622)
 #define CP4		0xFFEF 	// Code Protect block 4 
 #define CP5		0xFFDF 	// Code Protect block 5 
#if !defined(_18F6627) && !defined(_18F8627)
 #define CP6		0xFFBF 	// Code Protect block 6 
 #define CP7		0xFF7F 	// Code Protect block 7 
#endif
#endif
#endif
 #define CPA		0xFF00	// protect all code blocks
 #define CPD		0x7FFF 	// Code Protect data 
 #define CPB		0xBFFF 	// Code Protect boot block 
 #define CPALL		(CPA & CPD & CPB)

// Configuration register 6L
// Write Protection
 #define WRTEN		0xFFFF 	// Do write protect 
 #define WP0		0xFFFE 	// Write Protect block 0 
 #define WP1		0xFFFD 	// Write Protect block 1 
 #define WP2		0xFFFB 	// Write Protect block 2 
#if !defined(_18F6527) && !defined(_18F8527)
 #define WP3		0xFFF7 	// Write Protect block 3 
#if !defined(_18F6622) && !defined(_18F8622)
 #define WP4		0xFFEF 	// Write Protect block 4 
 #define WP5		0xFFDF 	// Write Protect block 5 
#if !defined(_18F6627) && !defined(_18F8627)
 #define WP6		0xFFBF 	// Write Protect block 6 
 #define WP7		0xFF7F 	// Write Protect block 7 
#endif
#endif
#endif
 #define WPA		0xFF00	// Write Protect all code blocks
 #define WPD		0x7FFF 	// Write Protect data 
 #define WPB		0xBFFF 	// Write Protect boot block 
 #define WPC		0xDFFF 	// Write Protect config area 
 #define WPALL		(WPA & WPD & WPB & WPC)

// Configuration register 7L
// Table read Protection
 #define TREN		0xFFFF 	// Do table read protect 
 #define TRP0		0xFFFE 	// Table read protect block 0 
 #define TRP1		0xFFFD 	// Table read protect block 1 
 #define TRP2		0xFFFB 	// Table read protect block 2 
#if !defined(_18F6527) && !defined(_18F8527)
 #define TRP3		0xFFF7 	// Table read protect block 3 
#if !defined(_18F6622) && !defined(_18F8622)
 #define TRP4		0xFFEF 	// Table read protect block 4 
 #define TRP5		0xFFDF 	// Table read protect block 5 
#if !defined(_18F6627) && !defined(_18F8627)
 #define TRP6		0xFFBF 	// Table read protect block 6 
 #define TRP7		0xFF7F 	// Table read protect block 7 
#endif
#endif
#endif
 #define TRPA		0xFF00	// Table read protect all code blocks
 #define TRPB		0xBFFF 	// Table read protect boot block 
 #define TRPALL		(TRPA & TRPB)

#endif
